SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Application/Device/MM32L0180/Include/reg_flash.h
/**
  * @brief FLASH_WRPR0 Register Bit Definition
  */
#define  FLASH_WRPR0_WRP0_Pos                     (0)
#define  FLASH_WRPR0_WRP0_Msk                     (0xFFFFFFFFU << FLASH_WRPR0_WRP0_Pos)             /*!<Write protect*/
#define  FLASH_WRPR0_WRP0                         FLASH_WRPR0_WRP0_Msk
#define  FLASH_WRPR0_WRP0_0                       (0x00000001U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_1                       (0x00000002U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_2                       (0x00000004U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_3                       (0x00000008U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_4                       (0x00000010U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_5                       (0x00000020U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_6                       (0x00000040U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_7                       (0x00000080U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_8                       (0x00000100U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_9                       (0x00000200U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_10                      (0x00000400U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_11                      (0x00000800U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_12                      (0x00001000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_13                      (0x00002000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_14                      (0x00004000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_15                      (0x00008000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_16                      (0x00010000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_17                      (0x00020000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_18                      (0x00040000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_19                      (0x00080000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_20                      (0x00100000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_21                      (0x00200000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_22                      (0x00400000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_23                      (0x00800000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_24                      (0x01000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_25                      (0x02000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_26                      (0x04000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_27                      (0x08000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_28                      (0x10000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_29                      (0x20000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_30                      (0x40000000U << FLASH_WRPR0_WRP0_Pos) 
#define  FLASH_WRPR0_WRP0_31                      (0x80000000U << FLASH_WRPR0_WRP0_Pos) 

/**
  * @brief FLASH_WRPR1 Register Bit Definition
  */
#define  FLASH_WRPR1_WRP1_Pos                     (0)
#define  FLASH_WRPR1_WRP1_Msk                     (0xFFFFFFFFU << FLASH_WRPR1_WRP1_Pos)             /*!<Write protect*/
#define  FLASH_WRPR1_WRP1                         FLASH_WRPR1_WRP1_Msk
#define  FLASH_WRPR1_WRP1_0                       (0x00000001U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_1                       (0x00000002U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_2                       (0x00000004U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_3                       (0x00000008U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_4                       (0x00000010U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_5                       (0x00000020U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_6                       (0x00000040U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_7                       (0x00000080U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_8                       (0x00000100U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_9                       (0x00000200U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_10                      (0x00000400U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_11                      (0x00000800U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_12                      (0x00001000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_13                      (0x00002000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_14                      (0x00004000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_15                      (0x00008000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_16                      (0x00010000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_17                      (0x00020000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_18                      (0x00040000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_19                      (0x00080000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_20                      (0x00100000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_21                      (0x00200000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_22                      (0x00400000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_23                      (0x00800000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_24                      (0x01000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_25                      (0x02000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_26                      (0x04000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_27                      (0x08000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_28                      (0x10000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_29                      (0x20000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_30                      (0x40000000U << FLASH_WRPR1_WRP1_Pos) 
#define  FLASH_WRPR1_WRP1_31                      (0x80000000U << FLASH_WRPR1_WRP1_Pos) 

/**
  * @brief FLASH_PGCNT Register Bit Definition
  */
#define  FLASH_PGCNT_PGCNT_Pos                    (0)
#define  FLASH_PGCNT_PGCNT_Msk                    (0x7U << FLASH_PGCNT_PGCNT_Pos)                   /*!<*/
#define  FLASH_PGCNT_PGCNT                        FLASH_PGCNT_PGCNT_Msk
#define  FLASH_PGCNT_PGCNT_0                      (0x1U << FLASH_PGCNT_PGCNT_Pos) 
#define  FLASH_PGCNT_PGCNT_1                      (0x2U << FLASH_PGCNT_PGCNT_Pos) 
#define  FLASH_PGCNT_PGCNT_2                      (0x4U << FLASH_PGCNT_PGCNT_Pos) 

#endif

